# St7GetElementProperty

Returns the property assigned to the specified element.

long St7GetElementProperty(long uID, long Entity, long EntityNum, long* PropNum)

Input Parameters

uID

Strand7 model file ID.

Entity

One of ptBEAMPROP, ptPLATEPROP or ptBRICKPROP.

EntityNum

Entity number.

Output Parameters

PropNum

Property number.